libmcu/madi/ports/esp-idf/boards/madi_esp32s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="ports/esp-idf/partitions_8mb.csv"
CONFIG_PARTITION_TABLE_FILENAME="ports/esp-idf/partitions_8mb.csv"
CONFIG_PARTITION_TABLE_OFFSET=0xE000

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=5632
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Make USB-Serial-JTAG the primary console so stdin/stdout use /dev/tty.usbmodem*
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
